foolish-products/likewhoa-examples/hardware/teeonardu/avr/boards.txt
menu.UsbType=USB Type
menu.KeyLayout=Keyboard Layout

FloraTeensyCore.name=Whoa Board (TeensyCore)
FloraTeensyCore.build.vid=0x239A
FloraTeensyCore.build.pid=0x8004
FloraTeensyCore.build.board=TEEONARDU_FLORA
FloraTeensyCore.upload.protocol=avr109
FloraTeensyCore.upload.maximum_size=28672
FloraTeensyCore.upload.speed=57600
FloraTeensyCore.upload.disable_flushing=true
FloraTeensyCore.upload.use_1200bps_touch=true
FloraTeensyCore.upload.wait_for_upload_port=true
FloraTeensyCore.upload.tool=arduino:avrdude
FloraTeensyCore.bootloader.low_fuses=0xff
FloraTeensyCore.bootloader.high_fuses=0xd8
FloraTeensyCore.bootloader.extended_fuses=0xcb
FloraTeensyCore.bootloader.path=caterina
FloraTeensyCore.bootloader.file=Caterina-Flora8.hex
FloraTeensyCore.bootloader.unlock_bits=0x3F
FloraTeensyCore.bootloader.lock_bits=0x2F
FloraTeensyCore.bootloader.tool=arduino:avrdude
FloraTeensyCore.serial.restart_cmd=true
FloraTeensyCore.serial.safe_baud_rates_only=true
FloraTeensyCore.build.mcu=atmega32u4
FloraTeensyCore.build.core=TeeOnArdu
FloraTeensyCore.build.vid=0x239A
FloraTeensyCore.build.pid=0x8004 
FloraTeensyCore.build.f_cpu=8000000L
FloraTeensyCore.build.variant=whoaboard1
FloraTeensyCore.build.elide_constructors=true
FloraTeensyCore.build.cpp0x=true
FloraTeensyCore.build.dependency=true
FloraTeensyCore.build.linker_relaxation=true
FloraTeensyCore.build.serial_number=true
FloraTeensyCore.menu.UsbType.serial=Serial
FloraTeensyCore.menu.UsbType.serial.build.define0=-DUSB_SERIAL
FloraTeensyCore.menu.UsbType.hid=Keyboard + Mouse + Joystick
FloraTeensyCore.menu.UsbType.hid.build.define0=-DUSB_HID
FloraTeensyCore.menu.UsbType.hid.fake_serial=teensy_gateway
FloraTeensyCore.menu.UsbType.serialhid=Serial + Keyboard + Mouse + Joystick
FloraTeensyCore.menu.UsbType.serialhid.build.define0=-DUSB_SERIAL_HID
FloraTeensyCore.menu.UsbType.int_disk=Disk(Internal) + Keyboard
FloraTeensyCore.menu.UsbType.int_disk.build.define0=-DUSB_DISK
FloraTeensyCore.menu.UsbType.int_disk.fake_serial=teensy_gateway
FloraTeensyCore.menu.UsbType.int_disk.build.elfpatch=mktinyfat
FloraTeensyCore.menu.UsbType.sd_disk=Disk(SD Card) + Keyboard
FloraTeensyCore.menu.UsbType.sd_disk.build.define0=-DUSB_DISK_SDFLASH
FloraTeensyCore.menu.UsbType.sd_disk.fake_serial=teensy_gateway
FloraTeensyCore.menu.UsbType.midi=MIDI
FloraTeensyCore.menu.UsbType.midi.build.define0=-DUSB_MIDI
FloraTeensyCore.menu.UsbType.midi.fake_serial=teensy_gateway
FloraTeensyCore.menu.UsbType.rawhid=Raw HID
FloraTeensyCore.menu.UsbType.rawhid.build.define0=-DUSB_RAWHID
FloraTeensyCore.menu.UsbType.rawhid.fake_serial=teensy_gateway
FloraTeensyCore.menu.UsbType.flightsim=Flight Sim Controls
FloraTeensyCore.menu.UsbType.flightsim.build.define0=-DUSB_FLIGHTSIM
FloraTeensyCore.menu.UsbType.flightsim.fake_serial=teensy_gateway
FloraTeensyCore.menu.KeyLayout.en-us=US English
FloraTeensyCore.menu.KeyLayout.en-us.build.define1=-DLAYOUT_US_ENGLISH
FloraTeensyCore.menu.KeyLayout.fr-ca=Canadian French
FloraTeensyCore.menu.KeyLayout.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
FloraTeensyCore.menu.KeyLayout.xx-ca=Canadian Multilingual
FloraTeensyCore.menu.KeyLayout.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
FloraTeensyCore.menu.KeyLayout.da-da=Danish
FloraTeensyCore.menu.KeyLayout.da-da.build.define1=-DLAYOUT_DANISH
FloraTeensyCore.menu.KeyLayout.fi-fi=Finnish
FloraTeensyCore.menu.KeyLayout.fi-fi.build.define1=-DLAYOUT_FINNISH
FloraTeensyCore.menu.KeyLayout.fr-fr=French
FloraTeensyCore.menu.KeyLayout.fr-fr.build.define1=-DLAYOUT_FRENCH
FloraTeensyCore.menu.KeyLayout.fr-be=French Belgian
FloraTeensyCore.menu.KeyLayout.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
FloraTeensyCore.menu.KeyLayout.fr-ch=French Swiss
FloraTeensyCore.menu.KeyLayout.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
FloraTeensyCore.menu.KeyLayout.de-de=German
FloraTeensyCore.menu.KeyLayout.de-de.build.define1=-DLAYOUT_GERMAN
FloraTeensyCore.menu.KeyLayout.de-dm=German (Mac)
FloraTeensyCore.menu.KeyLayout.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
FloraTeensyCore.menu.KeyLayout.de-ch=German Swiss
FloraTeensyCore.menu.KeyLayout.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
FloraTeensyCore.menu.KeyLayout.is-is=Icelandic
FloraTeensyCore.menu.KeyLayout.is-is.build.define1=-DLAYOUT_ICELANDIC
FloraTeensyCore.menu.KeyLayout.en-ie=Irish
FloraTeensyCore.menu.KeyLayout.en-ie.build.define1=-DLAYOUT_IRISH
FloraTeensyCore.menu.KeyLayout.it-it=Italian
FloraTeensyCore.menu.KeyLayout.it-it.build.define1=-DLAYOUT_ITALIAN
FloraTeensyCore.menu.KeyLayout.no-no=Norwegian
FloraTeensyCore.menu.KeyLayout.no-no.build.define1=-DLAYOUT_NORWEGIAN
FloraTeensyCore.menu.KeyLayout.pt-pt=Portuguese
FloraTeensyCore.menu.KeyLayout.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
FloraTeensyCore.menu.KeyLayout.pt-br=Portuguese Brazilian
FloraTeensyCore.menu.KeyLayout.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
FloraTeensyCore.menu.KeyLayout.es-es=Spanish
FloraTeensyCore.menu.KeyLayout.es-es.build.define1=-DLAYOUT_SPANISH
FloraTeensyCore.menu.KeyLayout.es-mx=Spanish Latin America
FloraTeensyCore.menu.KeyLayout.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
FloraTeensyCore.menu.KeyLayout.sv-se=Swedish
FloraTeensyCore.menu.KeyLayout.sv-se.build.define1=-DLAYOUT_SWEDISH
FloraTeensyCore.menu.KeyLayout.en-gb=United Kingdom
FloraTeensyCore.menu.KeyLayout.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
FloraTeensyCore.menu.KeyLayout.usint=US International
FloraTeensyCore.menu.KeyLayout.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

